{
  "days": [
    {
      "day": "Friday",
      "date": "June 11, 2021",
      "events": [
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Registration",
          "time": "7:30am - 8:45am",
          "type": "Social",
          "location": "Sheraton Hotel\n150 W 500 S,\nSalt Lake City, UT 84101",
          "description": "",
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLSe0qZaEL7pDfs4C2uSKsmSCeHNaznCrb_DGjUi6DWJMXAPIKg/viewform?usp=pp_url&entry.1565515700=Registration&entry.98669354=Sheraton+Hotel+150+W+500+S,+Salt+Lake+City,+UT+84101"
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Keynote 1",
          "time": "9:00am - 10:45am",
          "type": "Keynote",
          "room": "Grand Ballroom",
          "speakers": [
            {
              "name": "Nik Day",
              "bio": "",
              "photo": ""
            },
            {
              "name": "Spencer Thompson",
              "bio": "",
              "photo": ""
            }
          ],
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Keynote+1&entry.68503817=Gentri"
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Breakout 1",
          "time": "11:00am - 12:30pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Sexual Self Mastery: Eliminating Unwanted Sexual Behavior",
              "room": "Wasatch",
              "demographic": "SSA Men",
              "moderator": {
                "name": "Warren Bittner",
                "bio": "Warren Bittner has been involved with the NorthStar community since its inception. He is the founder and director of Sons of Sacrifice, a Christ-centered online sexual self-mastery and addiction recovery training program tailored to the unique needs of same-sex attracted, believing member of the Church of Jesus Christ of Latter-day Saints."
              },
              "panelists": [
                { "name": "Maurice Harker" },
                { "name": "Ryan Peeples" },
                { "name": "Leland Wilson" }
              ],
              "description": "This is a panel from an online group of SSA men practicing new successful techniques for eliminating unwanted behavior.  The panel will introduce the training program and then spend most of the time answering questions from the audience about successful tools for eliminating unwanted sexual behavior.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            },
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Writing Your Own Story: Principles for Thriving in a Mixed - Orientation Marriage",
              "room": "Deer Valley",
              "demographic": "Spouses",
              "speakers": [
                {
                  "name": "Ty and Danielle Mansfield",
                  "bio": "Danielle did her undergraduate work in Spanish and Italian and then earned an MBA from BYU. She worked in the private sector before leaving the work force eight years ago. Ty is a practicing marriage and family therapist and an Adjunct Instructor at BYU. He is a founding member and past president of North Star and is currently serving as a member of the board of directors. Ty and Danielle have been married for 11 years and currently live in Spanish Fork, Utah, with their five much-loved children."
                }
              ],
              "description": "Is it possible to thrive in a mixed-sexuality relationship? In a culture that questions it, Danielle and Ty Mansfield share stories and insights from their own marriage, highlighting applicable principles for happiness that can help any couple as they work together to write their own story.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            },
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Building Local Community",
              "room": "Brighton / Alta",
              "demographic": "General",
              "moderator": {
                "name": "Erick Hacking",
                "bio": "Erick grew up Orem, Utah, and served a mission in Seoul, Korea. Growing up, he believed that if he lived righteously, kept the commandments, and followed God’s plan he would be miraculously “cured” of SSA. Erick discovered Voices of Hope and North Star in the Spring of 2015. It was the first time he realized he wasn’t really alone in his struggles. He and his wife Kathi live in Naperville, Illinois. He is excited to find ways to help those outside of Utah build support and love locally."
              },
              "speakers": [],
              "panelists": [
                {
                  "name": "Tember Harward",
                  "bio": "Tember hails from Southern California but currently lives in Rexburg, Idaho. He is married and they have two small children. Tember is a convert to the Church as of 2012. His passion is helping members internationally who experience same-sex attraction. He leads “Beacon: Ministry for Same-Sex-Attracted Latter-day Saints” and volunteers with North Star."
                },
                { "name": "Bryan Korth" },
                { "name": "Michelle Sherwin" }
              ],
              "description": "Have you ever wondered how to build a local support community to help you on your journey? Who would you talk to? How would you tell others about it? These questions and many more will be answered as our panel discusses steps they and others have taken to start a support group.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            },
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Walk with Christ Through Faith Crisis",
              "room": "Snowbird",
              "demographic": "General",
              "moderator": {
                "name": "Dan Ellsworth",
                "bio": "Dan is a Latter-Day Saint consultant and writer living in Charlottesville, Virginia. Dan also volunteers in faith crisis ministry among Latter-Day Saints, and blogs at Nauvooneighbor.org."
              },
              "speakers": [],
              "description": "In April 2020, President Dallin H. Oaks said, \"Many of our members do not fully understand this Plan of Salvation, which answers most questions about the doctrine and inspired policies of the restored Church.\" In this breakout session, we will explore common misunderstandings about the plan of salvation and how they contribute to disillusionment and faith crisis. We will explore the impact of personal conversion to the revealed Christ.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            },
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Seeking Revelation",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "General",
              "moderator": {
                "name": "Jennie Taylor",
                "bio": "Jennie is a widowed mother of seven children ages 3 to 15. She is a graduate of BYU and Utah State University. She currently serves as the volunteer Civilian Aide to the Secretary of the Army for the State of Utah and is the founder/director of the Major Brent Taylor Foundation. She has a passion for finding (and creating) purpose in life, and has an ever-increasing faith that God can always be found in the details."
              },
              "speakers": [],
              "description": "Ancient brothers Nephi and Lehi reportedly received \"many revelations daily\" (Helaman 11:23). When was the last time YOU experienced personal revelation in YOUR life, and is it something that happens many times a day? How can we improve our efforts to both seek and receive revelation from the Lord? And what is the purpose of that personal revelation in each of our daily lives? Join us for a candid conversation about how to find and follow the voice of the Lord – even when the details of our lives differ quite drastically from the expectations of our past.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            },
            {
              "breakoutTitle": "Breakout 1",
              "type": "Breakout Session",
              "time": "11:00am - 12:30pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Finding Healing Through Community While Learning to Connect, Accept, and Support Your Transgender/Non-binary Child",
              "room": "Big Cottonwood",
              "demographic": "Transgender",
              "moderator": {
                "name": "Blaine Hickman",
                "bio": "Blaine has been a therapist in both Davis and Weber County Utah for 15 years specializing in severe mental health issues in the Inpatient Psychiatry setting as well as issues related to sexual orientation and gender identity in his private practice. His therapeutic approach is heavily influenced by Mindfulness-based practices and he is currently working on certification as a Mindfulness Based Stress Reduction instructor through Brown University. Blaine lives in Layton, Utah, with his wife Lindsay and three boys."
              },
              "speakers": [],
              "description": "There are so many passionate voices out there about the right and wrong way to approach issues surrounding gender identity, and the voices and opinions about the right and wrong way to parent a child grappling with concerns of this kind are some of the loudest. With every apparent answer comes an emotional rebuttal that seems to bring up more and more questions. \"Of course, I love my child, but what does loving my transgender/non-binary child look like exactly?\" In this closed-door session, parents of trans/non-binary children will have the opportunity to discuss these issues in an open way. This won't be about getting prescribed answers, but about exploring the issues and feelings associated with topics that can often be so confusing and difficult to address.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=The+Power+of+Stillness&entry.68503817=Ty+Mansfield,+Jacob+Hess,+Carrie+Skarda"
            }
          ]
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Lunch",
          "time": "12:45pm - 1:45pm",
          "type": "Social",
          "room": "Grand Ballroom",
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLSe0qZaEL7pDfs4C2uSKsmSCeHNaznCrb_DGjUi6DWJMXAPIKg/viewform?usp=pp_url&entry.1565515700=Lunch&entry.98669354=Grand+Ballroom"
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Breakout 2",
          "time": "2:00pm - 3:00pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "How We Balance Friendships and Marriage: A Panel of SSA Women",
              "room": "Wasatch",
              "demographic": "SSA Women",
              "speakers": [],
              "moderator": {
                "name": "Becky Borden",
                "bio": "Becky Borden lives in Heber City, Utah, on Beckett Farm, with her husband, Bennett. Becky works for the Church in the Priesthood and Family Department where she focuses on LGBTQ issues and other programs. Becky came out in her early 20s and lived with same-sex partners for 20 years before returning to the Church and being rebaptized in 2013. Becky is an emeritus member of the Board of Directors. She and Bennett have been married 8 years and were sealed in the DC temple in 2014."
              },
              "panelists": [
                { "name": "Jenn Curtis" },
                { "name": "Livier Haynes" },
                { "name": "Lexi Weyland" }
              ],
              "description": "Balancing friendships and marriage can present challenges for SSA/gay individuals. In this panel discussion we will hear the different approaches and experiences of a few gay/SSA women within the Latter-day Saint community. The panel will be moderated by Becky Borden, North Star board member, and current employee of the Church in the Priesthood and Family Department.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            },
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Healthy Male Friendships 101",
              "room": "Deer Valley",
              "demographic": "SSA Men",
              "speakers": [],
              "moderator": {
                "name": "Greg Reichmann",
                "bio": "Greg is an active member of the Church of Jesus Christ of Latter-day Saints and currently lives in California. Seven years ago tragedy struck Greg’s family that set him on a difficult journey that eventually lead to rock bottom. He began the repentance process and found that this trials deepened his appreciation for and his faith in Jesus Christ. Greg is excited to share more of his story and the things he has learned about putting trust in God and our Savior. "
              },
              "description": "Have you ever found it difficult to start a conversation or friendship with someone new? What about building and maintaining existing friendships? We will be addressing these topics and more during this breakout session.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            },
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "The Many Shades of Gender Dysphoria: Transgender 101",
              "room": "Brighton / Alta",
              "demographic": "Transgender",
              "speakers": [],
              "moderator": {
                "name": "Brandon Jenson",
                "bio": "Brandon (He/Him) grew up in Orem, Utah. He married his beautiful wife Tina 21 years ago and has four children. They currently live in Eagle Mountain, Utah. He came out as transgender seven years ago and counts North Star and many of its members as his biggest blessing. Brandon is a Licensed Clinical Social Worker and works for Flourish Therapy providing mental health therapy for the LGBTQIA community. He also has his own part-time counseling practice, providing telehealth mental health therapy. "
              },
              "panelists": [
                { "name": "Lynsie Andreasky" },
                { "name": "Lee Bennett" },
                { "name": "Lucas Jones" },
                { "name": "Miranda Stewart" }
              ],
              "description": "None are exempt from the enduring strength made available through adhering to eternal gospel principles; but finding hope on our journey can be difficult. This panel will discuss how others have been able to hold onto hope regardless of their transitionary state. Learn from others and find hope and healing through your life's journey.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            },
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Ministering to our LGBTQ/SSA Youth",
              "room": "Snowbird",
              "demographic": "Church Leaders",
              "speakers": [],
              "moderator": {
                "name": "Alec Barrow",
                "bio": "Alec Barrow (he/him) is a life-long member of the Church of Jesus Christ of Latter-day Saints and identifies as gay. He and his wife, Irene, have been married 30 years and are the parents of 5 children and one grandchild. Alec has been a teacher in the Church Educational System since 1995 and has been in private practice as a psychotherapist since 2017."
              },
              "description": "President Jean B. Bingham taught, \"No matter what age, when we consider how to minister most effectively, we ask, 'What does she (he, they) need?'.\" In order to minister to our LGBTQ+ youth so they feel loved and safe at home and in the Church, we ask \"What do they need?\" In this session, we will seek to understand what our LGBTQ+ youth need and how we can better minister to them.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            },
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "How to Have Empathy When Your LGBTQ/SSA Loved One Makes Choices that Don't Align with Your Belief System",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "Parent/Family",
              "speakers": [],
              "moderator": {
                "name": "Lynette Braddock",
                "bio": "Passionate about learning from people’s experiences different than her own, Lynette strives to see others through an empathetic lens, especially with her own transgender child. Through this child, Heavenly Father is teaching her the true meanings of love, compassion, and empathy. With a desire to help youth, Lynette serves on her school district’s Department of Equity and Inclusion, is a Court Appointed Special Advocate (CASA) for children, and volunteers with One-n-ten, a nonprofit dedicated to serving LGBTQ+ youth in Arizona. "
              },
              "description": "What can you do to feel and share genuine empathy with your LGBTQ/SSA loved one as they travel down a path you never envisioned? Your own choices and the empathy you show are likely to be the connecting light that will help them feel God’s unwavering love. Come and discuss how empathy can heal both you and your LGBTQ/SSA loved one so that you can stay close and connected even when your paths are diverging.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            },
            {
              "breakoutTitle": "Breakout 2",
              "type": "Breakout Session",
              "time": "2:00pm - 3:00pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Spouses Facilitated Discussion: Closed Door Discussion",
              "room": "Big Cottonwood",
              "demographic": "Spouses",
              "speakers": [],
              "moderator": {
                "name": "Kristin Hodson",
                "bio": "Kristin Hodson is a Licensed Clinical Social Worker and an AASECT Certified Sex Therapist – and she's determined to make it easier for all of us to talk about sex, no matter where we started from.  Kristin is a mom to three wild things and a partner to her husband, Jake. They live in Salt Lake City, Utah, and Playa Grande, Costa Rica."
              },
              "description": "This will be facilitated by Kristin Hodson as a safe place to ask questions, listen, and hold space for each other who are navigating mixed-orientation relationships.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Open+to+the+Idea+of+Being+Married&entry.68503817=Vaughn+Armstrong,+Bob+and+Debbie+Stevens,+Liv+and+Matthew+Haynes,+Charles+and+Julee+Hamilton"
            }
          ]
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Breakout 3",
          "time": "3:15pm - 4:15pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Love Boldly: Embracing Your LGBTQ/SSA Loved Ones and Your Faith",
              "room": "Wasatch",
              "demographic": "Parent/Family",
              "moderator": {
                "name": "Scott and Becky Mackintosh",
                "bio": "Scott and Becky are the parents of 7 children and 14 grandchildren. After their son came out as gay, they began opening up about their experiences as parents of an LGBTQ child. Becky received many emails and calls from concerned parents, as well as LGBTQ individuals. She has certifications in QPR, Youth Mental Health First Aid, and Grief Support. She is the author of Love Boldly: Embracing Your LGBTQ Loved Ones and Your Faith. (Scott shares his story in the Epilogue). The Mackintosh family experience was filmed for the Church’s website, a video that now has over one million views. "
              },
              "speakers": [],
              "description": "Is SSA/LGBTQ splitting your family apart? Does it cause contention between family members? Do you feel uncomfortable talking to your family members about their SSA/LGBTQ feelings? Do you feel that supporting your SSA/LGBTQ son or daughter means that you are condoning their choices? In this panel we will discuss ways in which each member of the family can feel validated, loved, and accepted. We will discuss the difference between condoning and accepting and outline ways to facilitate a respectful and safe space for everyone to be able to express their feelings and opinions without creating an atmosphere of judgement and contention.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            },
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Shame to Joy",
              "room": "Deer Valley",
              "demographic": "General",
              "moderator": {
                "name": "Tyler Moore",
                "bio": "Tyler is a former member of the North Star Executive Committee and the North Star Board. He has found immense peace and joy in doing work around releasing shame and helping others to do similarly. Tyler has a strong testimony of the Jesus Christ as the Master Healer and the Church of Jesus Christ of Latter-day Saints."
              },
              "speakers": [],
              "description": "Ever feel like living the gospel brings more shame than joy? Come join this session to find ways to bring the “happy” back into the plan of happiness. God is not offended by you, He loves you!",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            },
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "How to Make Sure Your Emotional Needs Are Met",
              "room": "Brighton / Alta",
              "demographic": "SSA Men",
              "moderator": {
                "name": "Bob Stahn",
                "bio": "Bob is a Licensed Clinical Professional Counselor, a Certified Clinical Trauma Professional and a Master Addictions Counselor. He has a Bachelor’s degree in Pre-Clinical Psychology from BYU and an Education Master’s degree in Counseling from Boston University. Bob has over 35 years of experience in the fields of psychology and substance abuse working with adolescents and adults. He is the owner and Clinical Director of Well Spring Counseling and author of the self-help book “Get Your Needs Met!” He and his wife, Donella, proudly have 11 children and 26 grandchildren (of which two are gay)."
              },
              "speakers": [],
              "description": "Why do I do what I do? Why do I continue to do certain things even when I don’t want to? Why is it that others don’t adequately meet my needs? Why do I feel empty or lacking? How do I guarantee my happiness? In this breakout session you will learn answers to these questions along with what emotional needs are, why meeting those needs is important, and an overview of how to ensure your needs are met.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            },
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Sexual Fluidity: What Does that Look Like in a Covenant Marriage?",
              "room": "Snowbird",
              "demographic": "SSA Women",
              "moderator": {
                "name": "Meghan Decker",
                "bio": "Meghan is a writer, public speaking coach, teacher, and gay Latter-day Saint. She is a co-author of Reaching for Hope: An LDS Perspective on Recovering from Depression. Meghan taught seminary and institute classes for thirteen years and currently serves as Relief Society president. She is indebted to Twelve Step programs for inviting her to “let go and let God.” Meghan and her husband David have five daughters and fifteen grandchildren. She enjoys taking long walks in the woods, exploring the world, and discovering restaurants and new recipes."
              },
              "speakers": [],
              "description": "How could a married heterosexual woman suddenly find herself romantically attracted to her best friend? Can a gay woman really find happiness in a mixed-orientation marriage? Why isn’t there a label for “attracted to women and one particular guy?” While these questions are multi-dimensional and nuanced, we can develop valuable perspective as we discuss the concept of sexual fluidity, what it is and what it is not, and how it may manifest in our lives.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            },
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "From Brothers to Leaders: How the Spirit Turned a Struggle into a Blessing",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "Church Leaders",
              "speakers": [
                {
                  "name": "Brent Ebmeyer",
                  "bio": "Brent has been a member of The Church of Jesus Christ of Latter-day Saints his whole life and served a mission in Argentina. He and Courtney married in 2004 and have five children. A year after they were sealed in the temple Brent shared that he experiences same-sex attraction. It took them to the brink of separation, but through consistent communication, compassion, and love they have been able to find hope in their future together."
                },
                {
                  "name": "Bruce Ebmeyer",
                  "bio": "Bruce has been married to his high school sweetheart, Carolyn, for 30 years and they have eight children. Born and raised in the church, he has served in various callings including full-time missionary, Stake High Counselor, Stake Young Men's President, Bishop, and is currently a Stake President. He owns and operates a transportation company. He likes to work and travel."
                }
              ],
              "description": "Have you ever heard the saying 'good things (blessings) come to those who wait'? This was the case with brothers, Bruce and Brent Ebmeyer. Brent came out as gay to his wife and family in 2005. Rivers of tears were shed and it created many deep wounds. But throughout the years, these tears of pain morphed into tears of joy. Listen to and learn how the spirit and the blessing of leadership changed this struggle into strength for not only one relationship, but countless others.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            },
            {
              "breakoutTitle": "Breakout 3",
              "type": "Breakout Session",
              "time": "3:15pm - 4:15pm",
              "day": "Friday",
              "date": "June 11, 2021",
              "title": "Trans Spouses Facilitated Discussion: Closed Door Discussion",
              "room": "Big Cottonwood",
              "demographic": "Spouses",
              "moderator": {
                "name": "Kristin Hodson",
                "bio": "Kristin Hodson is a Licensed Clinical Social Worker and an AASECT Certified Sex Therapist – and she's determined to make it easier for all of us to talk about sex, no matter where we started from.  Kristin is a mom to three wild things and a partner to her husband, Jake. They live in Salt Lake City, Utah, and Playa Grande, Costa Rica."
              },
              "speakers": [],
              "description": "This will be facilitated by Kristin Hodson as a safe place to ask questions, listen, and hold space for each other who are navigating transgender relationships.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Trans+Spouses+Facilitated+Discussion:+Closed+Door+Session&entry.68503817="
            }
          ]
        },
        {
          "day": "Friday",
          "date": "June 11, 2021",
          "title": "Keynote 2",
          "time": "4:30pm - 5:45pm",
          "type": "Keynote",
          "room": "Grand Ballroom",
          "speakers": [{ "name": "Michael McLean" }],
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Keynote+2&entry.68503817=Emily+Belle+Freeman,+David+Butler"
        }
      ]
    },
    {
      "day": "Saturday",
      "date": "June 12, 2021",
      "events": [
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Registration",
          "time": "7:30am - 8:45am",
          "type": "Social",
          "location": "Sheraton Hotel\n150 W 500 S,\nSalt Lake City, UT 84101",
          "description": "",
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLSe0qZaEL7pDfs4C2uSKsmSCeHNaznCrb_DGjUi6DWJMXAPIKg/viewform?usp=pp_url&entry.1565515700=Registration&entry.98669354=Sheraton+Hotel+150+W+500+S,+Salt+Lake+City,+UT+84101"
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Keynote 3",
          "time": "9:00am - 10:15am",
          "type": "Keynote",
          "room": "Grand Ballroom",
          "speakers": [{ "name": "Carol McConkie" }],
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Keynote+3&entry.68503817=Scott+and+Becky+Mackintosh"
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Breakout 4",
          "time": "10:30am - 12:00pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "What I Have Learned from My LGBTQ/SSA Church Members",
              "room": "Wasatch",
              "demographic": "Church Leaders",
              "panelists": [
                {
                  "name": "Kurt Francom",
                  "bio": "Kurt is Executive Director of Leading Saints, a non-profit organization dedicated to helping Latter-day Saint lay leaders be better prepared to lead. Kurt hosts the Leading Saints podcast. He enjoys drawing caricatures, playing basketball, reading, and college football. He has served in many positions in the church including a full-time mission, Bishop and in a Stake Presidency. He lives in Holladay, Utah, with is his lovely wife Alanna. They are blessed to have a three children."
                },
                {
                  "name": "Jeff Christensen",
                  "bio": "Jeff is a Salt Lake native and has a B.S. in Psychology from the University of Utah and an M.S. in Management from Purdue University. He has been a principal at three different start-up companies. Jeff has been married to Chris Webster for 32 years and they have five children. He enjoys spending time with his wife working on their 1-acre East Millcreek property, keeping his 56-year-old body in motion, chasing grandchildren (which is way better than I anticipated) and reading."
                },
                {
                  "name": "Anne Clegg",
                  "bio": "Anne grew up in Holladay, Utah, raised 6 children mostly in Bountiful Utah and resides in Hilliard, Wyoming. She married the gregarious, 2-time cancer survivor, Dr. Richard Clegg. Anne has served two missions, Bilbao and Malaga Spain as Mission President and companion, and the Canary Islands. She has a B.A. from BYU. She loves her 19 grandchildren, enjoys snow skiing, reading, quilting, horseback riding, bicycling, and power walking. She served on the General Relief Society board from 2012-2017."
                },
                {
                  "name": "Bruce Ebmeyer",
                  "bio": "Bruce has been married to his high school sweetheart, Carolyn, for 30 years and they have eight children. Born and raised in the church, he has served in various callings including full-time missionary, Stake High Counselor, Stake Young Men's President, Bishop, and is currently a Stake President. He owns and operates a transportation company. He likes to work and travel."
                }
              ],
              "moderator": {},
              "speakers": [],
              "description": "As a church leader, you have the sacred opportunity to walk with members of your congregation from all walks of life. Come and hear from three different church leaders who will share their personal experiences and what they gained by working with LGBT/SSA members of their ward.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            },
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "The Importance of Communication in Marriage",
              "room": "Deer Valley",
              "demographic": "Spouses",
              "moderator": {
                "name": "Nikki Harmon",
                "bio": "Nikki is a Licensed Marriage and Family Therapist. She received her Bachelor’s Degree from BYU and her Master’s Degree from Alliant International University. Nikki has worked in a variety of clinical settings, and has extended training in Emotionally Focused Therapy for couples. She works with couples, families, and individuals dealing with anxiety, depression, marriage problems, divorce, blending families, and faith transitions. Nikki is an LGBTQIA+ ally and can be found on Facebook or Instagram at Nikki Harmon Therapy."
              },
              "speakers": [],
              "description": "In this session you will learn practical skills to improve communication in your marriage. You will learn about I-Statements, reflective listening, holding space, and other important skills that will improve your connection and communication, all with a gospel twist. You can also use these skills with your children, in-laws, or anyone in your life you would like to more fully connect with. ",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            },
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Making a Safe Space for Your LGBTQ/SSA Loved Ones",
              "room": "Brighton / Alta",
              "demographic": "Parent/Family",
              "moderator": {
                "name": "Travis and Margaret Steward",
                "bio": "Travis and Margaret have been married for 35 wonderful years and have six amazing children and four precious grandchildren. They live in Provo, Utah, where they love to spend time together in the garden, tending to bees and chickens, or escaping to their sweet little cabin in the mountains. They find great joy in facilitating support groups and being a resource for Gay/SSA men and their wives."
              },
              "speakers": [],
              "description": "What can hold us back from being a safe place for our LGBTQ loved one? Are we a help or a hinder? As family, friends and leaders, let's work to make sure we get this right.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            },
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Personal Development and Christ's Involvement in Every Place",
              "room": "Snowbird",
              "demographic": "General",
              "moderator": {
                "name": "Julie Hanks",
                "bio": "Dr. Julie Hanks, PhD, LCSW is a licensed psychotherapist, assistant professor, content creator, author, owner of Wasatch Family Therapy, and host of the Ask Dr. Julie Hanks podcast. With nearly 30 years of experience, Dr. Hanks provides a safe place for healing conversations that educate and empower women to prioritize their dreams, revolutionize their families, and personalize their faith. "
              },
              "speakers": [],
              "description": "As members of the Church of Jesus Christ of Latter-day Saints, we look to Christ as our perfect example of how to conduct our lives. When we teach of Christ’s life, we tend to focus on His service and sacrifice. Sometimes, we focus so much on the beautiful qualities of sacrifice and service to others that we inadvertently neglect caring for ourselves. But to be effective disciples, sacrifice must be balanced with self-care.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            },
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Principles of Reconciliation",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "General",
              "panelists": [
                {
                  "name": "Jeff Bennion",
                  "bio": "Jeff is a lifelong member of the Church. He married Tanya 15 years ago and live in Holladay, Utah, with their son. Jeff served a mission in Brussels, Belgium and has served throughout the church. He is a co-founder of North Star, and currently serves on the board. He works in real estate property management and recently earned a master’s degree in Marriage and Family Therapy and has a part-time therapy practice."
                },
                {
                  "name": "Tember Harward",
                  "bio": "Tember hails from Southern California but currently lives in Rexburg, Idaho. He is married and they have two small children. Tember is a convert to the Church as of 2012. His passion is helping members internationally who experience same-sex attraction. He leads “Beacon: Ministry for Same-Sex-Attracted Latter-day Saints” and volunteers with North Star."
                }
              ],
              "moderator": {},
              "speakers": [],
              "description": "In this session, Tember Harward and Jeff Bennion present the experiences of Latter-day Saints around who have same-sex attraction, as they apply the principles from the recently-released manual, Principles of Reconciliation: A guide for Latter-day Saints seeking to reconcile their faith in the restored Gospel of Jesus Christ with their experience of same-sex attraction. Attendees will learn about some of the unique challenges faced by members of the Church in other areas of the world, as well as how the universal application of Gospel principles can help to resolve the complexities of navigating faith and same-sex attraction",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            },
            {
              "breakoutTitle": "Breakout 4",
              "type": "Breakout Session",
              "time": "10:30am - 12:00pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Delighting in Sexual Complementarity: Creating Fullfillment and Pleasure with Your Wife",
              "room": "Big Cottonwood",
              "demographic": "SSA Men",
              "moderator": {
                "name": "Preston Dahlgren",
                "bio": "Pret grew up in Bismarck, North Dakota and later moved to Utah. He’s been married to his beautiful wife Megan for 15 years and they have five children. He works as a Senior Nursing Director of Surgical Services for the University of Utah. He has a Master's degree in Marriage and Family Therapy and practices part-time at Aurora Counseling. People are Pret’s real passion, and he enjoys helping them discover and live out their personal missions. He loves to go hunting, fishing and swimming."
              },
              "speakers": [],
              "description": "The body’s largest sex organ, the brain, often gets in the way of sexual fulfillment with your wife. In fact, performance focused sex can induce anxiety, stifling your body, mind, and spirit’s natural ability to harness passion. Join this closed, unrecorded session, for a frank discussion on how the brain, heart, and body’s synchrony are meant to bless our sexual lives and enable true intimacy (into-me-see) with your wife.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Bearing+one+another's+burdens:+How+to+lighten+the+burdens+of+your+SSA+/+Trans+members&entry.68503817=Richard+Ostler,+Brent+Ebmeyer,+Joey+Sheppard,+Myrna+Moll,+Robert+Burggraaf"
            }
          ]
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Lunch",
          "time": "12:15pm - 1:15pm",
          "type": "Social",
          "room": "Grand Ballroom",
          "description": "",
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLSe0qZaEL7pDfs4C2uSKsmSCeHNaznCrb_DGjUi6DWJMXAPIKg/viewform?usp=pp_url&entry.1565515700=Lunch&entry.98669354=Grand+Ballroom"
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Breakout 5",
          "time": "1:30pm - 2:30pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Ministering to LGBTQ Members",
              "room": "Wasatch",
              "demographic": "Church Leaders",
              "moderator": {
                "name": "Blake Smith",
                "bio": "Blake received life-saving ministry from a Bishop and members of his Elder's Quorum over 25 years ago that changed his life and prepared him for a life of service. He has served in many leadership roles at both the ward and stake level and is currently the Elder's Quorum President. He loves serving the Savior, spending time with family, providing ministry and support to others, and keeping his aging body in shape. He has been married to the love of his life, Denise, for 17 years."
              },
              "description": "Providing ministry to the LGBTQ+ members in your ward and their families is rewarding for you and them but can also be complex. The purpose of this session is to empower leaders of the Church to effectively navigate this challenging yet rewarding ministry. ",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            },
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Being Okay with Who I am",
              "room": "Deer Valley",
              "demographic": "General",
              "moderator": {
                "name": "Dennis Schleicher",
                "bio": "Dennis is the best-selling author of “Is He Nuts?: Why a Gay Man Would Become a Member of the Church of Jesus Christ.” At first, Dennis wanted to protest the church, then he stole a Book of Mormon, was baptized and now he’s becoming a much-sought-after fireside speaker. He is a ward mission leader assisting church leaders around the world understand the LGBT community. No matter your religion, faith, sexual orientation, or race, he challenges you to choose love!"
              },
              "description": "Dennis will take you on a journey of self-discovery, being your true self. No matter what others think. With his passion and contagious personality you won’t deny a sense of belonging, feeling loved. We are all unique children of God on our own individualized journeys. Don’t ever let another person’s opinion of you define your self-worth. What anyone else thinks is irrelevant. The Lord’s opinion is the one that matters, and He thinks the world of you.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            },
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Being the Parent Your Child Needs",
              "room": "Brighton / Alta",
              "demographic": "Parent/Family",
              "moderator": {
                "name": "Janae Monson",
                "bio": "Janae is a devoted wife and mother of 10 and has 3 grandbabies. She’s a victim’s advocate for domestic violence and sexual assault. She prefers to just be real and vulnerable, having a belief that what we have in common will always surpass what we don’t. Her testimony of the restored Gospel and the divinity of Jesus Christ is her most prized knowledge. Through her journey with her son who is gay she has come to know the love of the Lord on a higher level."
              },
              "description": "Having a child come out as gay can be shocking, overwhelming, and turn your family dynamic upside down. Spoiler: It doesn’t have to be this way! Though the learning curve can be steep and painful there is a peace that comes only from turning it all over to the Savior. Recognizing there is no one-size-fits-all approach to parenting and that the Atonement, while universal, is astoundingly personalized and individual for each of us we can take our parenting cues from Heavenly Father and find ourselves “waiting on the Lord” on a whole new level. We’ll explore the grieving process of our old expectations, willingness to be taught, cultural challenges within and without the church, testimony, and the great privilege it is to have these precious souls entrusted to our care.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            },
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Finding My Worth as a SSA/Gay Woman",
              "room": "Snowbird",
              "demographic": "SSA Women",
              "speakers": [
                {
                  "name": "Nancy Hales",
                  "bio": "Nancy was born in Haiti but has lived in Arizona for most of her life. She is passionate about weightlifting and is working on becoming a personal fitness trainer. She came out at the age of 16 and ever since has been trying to figure out how being queer fits into God’s plan for her life. She has found strength in being a member of the North Star Community and believes that being loving and accepting of anyone she meets can make a positive difference in the world. "
                },
                {
                  "name": "Myrna Moll",
                  "bio": "Myrna Moll lives with her husband of 30 years and daughter in Syracuse Utah. She started attending North Star events in 2003 after seeing an article about Ty Mansfield and she realized she was not alone. Myrna has served in many calling in the church at the Ward and Stake level. She shares her journey with SSA to help others see you can be active and acknowledge your SSA. Her very favorite thing to do is teach and share her testimony of our Savior and the Gospel."
                },
                {
                  "name": "Jodie Palmer",
                  "bio": "Jodie is a double unicorn as a gay redhead. She and her husband, Doug have been married 16 years and have four children. Navigating the intersections of faith, sexuality and chosen partner has been both a wonder and brutal. The contribution she most wishes to offer is to spread empathy and dialogue as the universal guides to navigating conflict while maintaining connection. She hopes to be an instrument of peace, a champion of beauty, a believer in the power of love, and to go with kindness."
                }
              ],
              "description": "How do you find your worth as a SSA/Gay Woman today?  Come to this breakout where you will here personal stories from three members of our North Star Community.  Come learn how they find their worth.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            },
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Lasting Friendships",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "SSA Men",
              "moderator": {
                "name": "Brad Peterson",
                "bio": "“Chef Brad” is a native of Arizona. He has been married to his wife Louise for 35 years. They have five wonderful kids and four even more wonderful grandkids. He has been heavily involved in Men’s work for 20 years and is a Certified Life Coach. Brad is a passionate speaker and motivator. The most important belief Brad has is that as children of God we have no limits on our heart when it comes to loving and accepting those around us."
              },
              "description": "Our need for friends has increased even more since COVID. Many of us are lonely and suffering from isolation and have recognized the need for deeper, more meaningful relationships. The question is how do we go about it? No matter the choice, as we learn to put Christ in the middle, miracles happen and friendships are forged that build and bless each other.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            },
            {
              "breakoutTitle": "Breakout 5",
              "type": "Breakout Session",
              "time": "1:30pm - 2:30pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Focusing on Personal Revelation When Guidance is Unclear",
              "room": "Big Cottonwood",
              "demographic": "Transgender",
              "moderator": {
                "name": "Jeff Case",
                "bio": "Jeff was born in upstate New York and grew up around the world as a military child. As an adult he attended BYU earning degrees in Music and Psychology, spent eight years as a clinical psychologist in the Army, and currently provides counseling services to military veterans and their families. He has been married to his best friend Sarah for 23 years. They are the parents of three children and live in Utah County."
              },
              "description": "This closed-door session will offer a chance to engage in a frank conversation about the need to seek and understand personal revelation. While the Church Handbook has updated its guidance regarding transgender Latter-day Saints, much is still left for the member to discover what a healthy direction for their lives might look like. Many members have learned to focus on a personal relationship with Christ to see their paths more clearly.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=A+Discussion+on+Healthy+Male+Friendships&entry.68503817=Brent+Ebmeyer,+Jarry+Lozano,+Chad+Hill,+Greg+Reichmann,+Justin+Mangum,+Pret+Dahlgren,+Troy+Dahlgren"
            }
          ]
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Breakout 6",
          "time": "2:45pm - 3:45pm",
          "type": "Breakout Group",
          "selectedSession": null,
          "sessions": [
            {
              "breakoutTitle": "Breakout 6",
              "type": "Breakout Session",
              "time": "2:45pm - 3:45pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "How We Make Our Marriage Work",
              "room": "Wasatch",
              "demographic": "Spouses",
              "moderator": {
                "name": "Becky and Bennett Borden",
                "bio": "Bennett and Becky Borden live in Heber City, Utah. They were married in 2013 and sealed in the Washington DC Temple in 2014. Bennett is a partner and Chief Data Scientist at a law firm in Washington, D.C. and Becky works for the Church in the Priesthood and Family department where she focuses on LGBTQ issues and other programs of the Church. Becky and Bennett have known each other for 30 years and met when Bennett served in Becky’s ward in North Carolina on his mission. After his mission both Bennett and Becky came out and lived with same-sex partners for the next 20 years. They both decided to return to the Church in 2012 and fell in love while going through that experience together. Bennett is past president of North Star and current member of the Board of Directors, and Becky is an emeritus member of the Board of Directors."
              },
              "description": "Becky and Bennett are delighted to present a session on the joy of marriage, especially when one or both spouses identifies as gay or SSA. Through some key techniques, diligent work, and a focus on our Savior, Jesus Christ, Becky and Bennett have found a way to true joy in their relationship. During this session they will share the history of their relationship, what things have helped them, how they’ve learned to love each other, warts and all, and how they have maintained their deep love for the past 8 years of marriage. They welcome all attendees to their session, married, single, and anyone who has decided to remain open to the possibility of an eternal marriage in the new and everlasting covenant.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Ministering+to+Those+Who+Question&entry.68503817=David+Ostler"
            },
            {
              "breakoutTitle": "Breakout 6",
              "type": "Breakout Session",
              "time": "2:45pm - 3:45pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "How Healthy Boundaries Can Help us Create Fulfilling Relationships while Staying True to our Covenants",
              "room": "Deer Valley",
              "demographic": "SSA Women",
              "moderator": {
                "name": "Cynthia Miller",
                "bio": "Cynthia is a wife of 20 years and a mother of three teenagers. They aren’t dead yet so she’s counting that as a win. Cynthia works at DoTERRA, loves building balloon arches and working with stained glass. She will try just about anything at least twice. She sings in the Lux Choral Society, plays many instruments and has a great love for music. She has a Bachelor’s degree in Criminal Justice and is working on her Master’s degree. "
              },
              "description": "A discussion about types of boundaries and how we can set them in honest and open ways to help fortify and strengthen relationships. By navigating this topic, we can start to understand how we can set boundaries in order to be true to ourselves, to our covenants and also have meaningful relationships with people. ",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Ministering+to+Those+Who+Question&entry.68503817=David+Ostler"
            },
            {
              "breakoutTitle": "Breakout 6",
              "type": "Breakout Session",
              "time": "2:45pm - 3:45pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Voices of Hope Where Are They Now and What Comes Next",
              "room": "Brighton / Alta",
              "demographic": "General",
              "moderator": {
                "name": "Garret and Sallie Ferguson",
                "bio": "Garrett and Sallie have been married for 10 years and have 4 kids. They live in the Dallas Texas area, and have actually never lived outside of the Lone Star State. Garrett is an architect by day and a DJ on the side. He enjoys mountain biking, trying new restaurants and chocolate chip cookies. Sallie enjoys running both miles and the family home. She also loves staying up late for book club, making lists, and taking trips to Sonic for a drink."
              },
              "panelists": [
                { "name": "Brett and Shaundra Cragun" },
                { "name": "Jenn Curtis" },
                { "name": "Spencer and Mary Thompson" }
              ],
              "description": "The Voices of Hope project launched in 2013 to share stories of LGBTQ+ members of the Church after the book was published in 2011. The project now includes over 70 voices and continues to grow! Come listen to a panel of some of the early voices and hear how people have responded to these videos over the years. Find out what panelists have learned from sharing their stories with the world and discover what's next for the Voices of Hope project and how voices big and small can make a difference.",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Ministering+to+Those+Who+Question&entry.68503817=David+Ostler"
            },
            {
              "breakoutTitle": "Breakout 6",
              "type": "Breakout Session",
              "time": "2:45pm - 3:45pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "You are Enough - Embracing God's Love",
              "room": "Snowbird",
              "demographic": "Transgender",
              "speakers": [
                {
                  "name": "Bree Bruce",
                  "bio": "Bree has experienced gender incongruence for about fifty years and currently identifies as somewhat gender fluid. An experience in 2019 caused a “coming out” and has since led to a more active role in the LGBTQ+ community with a focus on transgender issues. Bree has come to realize and accept who she really is and the love of our Heavenly Father and our Savior. Bree found a lifeline through the love and support of her spouse Kit and the wonderful people in the North Star community."
                },
                {
                  "name": "Brandon Jenson",
                  "bio": "Brandon (He/Him) grew up in Orem, Utah. He married his beautiful wife Tina 21 years ago and has four children. They currently live in Eagle Mountain, Utah. He came out as transgender seven years ago and counts North Star and many of its members as his biggest blessing. Brandon is a Licensed Clinical Social Worker and works for Flourish Therapy providing mental health therapy for the LGBTQIA community. He also has his own part-time counseling practice, providing telehealth mental health therapy. "
                },
                {
                  "name": "Landon Phillips-Turley",
                  "bio": "Landon currently resides in Mesa, Arizona. He identifies as transgender (FTM), and while this journey has changed and shaped him as a person, it's not even close to being the most important part of his life. He enjoys spending time with his husband and family. He loves to laugh and enjoys movies, art, music, and writing. He believes in making the best out of the cards he's been dealt and is passionate about helping others on the challenging LGBTQ road to find peace and belonging."
                }
              ],
              "description": "Is it possible to maintain hope while dealing with the challenges of gender dysphoria? It can oftentimes be a lonely and challenging road but one that is possible. Come hear the stories of three different individuals as they share their stories on what has brought them hope and how they embrace God's love for them. ",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Ministering+to+Those+Who+Question&entry.68503817=David+Ostler"
            },
            {
              "breakoutTitle": "Breakout 6",
              "type": "Breakout Session",
              "time": "2:45pm - 3:45pm",
              "day": "Saturday",
              "date": "June 12, 2021",
              "title": "Faithfully In-Between: Finding Connection and Belonging",
              "room": "Powder Mtn / Solitude / Sundance",
              "demographic": "General",
              "moderator": {
                "name": "Kylee Shields",
                "bio": "Kylee is a Licensed Clinical Social Worker and the Life Skills Director at Telos U. She has worked closely with adolescents in the areas of trauma, substance use, depression, anxiety, oppositional defiance, bereavement, processing disorders, process addictions, and more. Kylee is a published author, co-founder of a non-profit (INSPIRE: Music. Service. Hope), Music Director of the Utah chapter of INSPIRE Chorus, and a world traveler. She enjoys writing, playing her piano, singing, spending time with friends, nieces and nephews, and being outdoors."
              },
              "description": "Most of us operate on lies about loneliness and connection. In this session we will talk about what loneliness and pain are trying to tell us and why we, as a society, have become so pain adverse. We will discuss the importance of healthy grieving, the cost of connection (and why we need to be willing to pay that price), and so much more. If you are looking for a Belonging Place come join us!",
              "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Ministering+to+Those+Who+Question&entry.68503817=David+Ostler"
            }
          ]
        },
        {
          "day": "Saturday",
          "date": "June 12, 2021",
          "title": "Keynote 4",
          "time": "4:00pm - 5:30pm",
          "type": "Keynote",
          "room": "Grand Ballroom",
          "speakers": [
            {
              "name": "Ganel-Lyn Condie"
            }
          ],
          "feedbackURL": "https://docs.google.com/forms/d/e/1FAIpQLScQq-_3fse3EkhhFJXy5WIlM4k9glBXR6ZnjajEmLgoclMYRA/viewform?usp=pp_url&entry.1824840307=Keynote+4&entry.68503817=Becket+Cook"
        }
      ]
    }
  ]
}
